var k = {
    "_id": -1,
    "基本数据": { "已删除": false, "已屏蔽": false, "添加时间": "2014-12-13T08:09:22.546Z", "修改时间": "2014-12-13T08:09:22.546Z", "标签": null, "备注": null },
    "登录信息": { "登录名": null, "密码": null, "显示名": null, "头像": "/Images/default-avatar.png", "主题": null },
    "联系方式": { "联系人": null, "性别": 0, "电子邮件": null, "手机": null, "固定电话": null, "QQ": null, "微信": null, "微博": null, "传真": null, "其他": null },
    "所属地域": { "省份": null, "城市": null, "区县": null },
    "地址信息": [],
    "角色": [],
    "用户组": [],
    "所属管理单位": 0,
    "审核数据": { "审核状态": 0, "审核者": { "用户ID": -1 }, "审核时间": "0001-01-01T00:00:00Z", "审核不通过原因": null },
    //"上次出席评标时间": "0001-01-01T00:00:00Z",
    "身份信息": { "专家类型": 0, "姓名": null, "性别": 0, "民族": 0, "政治面貌": 0, "出生年月": "0001-01-01T00:00:00Z", "证件类型": 0, "证件号": null, "证件电子扫描件": null, "本人照片电子扫描件": null, "专家类别": 0 },
    "可参评物资类别列表": [{ "一级分类": "a设备", "二级分类": ["a1设备", "其他"] }, { "一级分类": "b设备", "二级分类": ["b1", "其他"] }],
    "学历信息": { "毕业院校": null, "专业技术职称": 0, "取得现技术职称时间": "0001-01-01T00:00:00Z", "职称证书电子扫描件": null, "最高学历": 0, "最高学位": 0 },
    "工作经历信息": { "参加工作时间": "0001-01-01T00:00:00Z", "从事专业": null, "从事专业起始年度": 0, "工作单位": null, "单位地址": { "地址类型": 0, "联系人": null, "传真": null, "手机": null, "固定电话": null, "传真电话": null, "电子邮件": null, "省份": null, "城市": null, "区县": null, "街道": null, "邮政编码": null }, "邮编": null, "现任职务": null, "健康状况": 0, "主要工作经历": null, "社会兼聘职情况": null, "本人参加过何种项目招标及评标": null, "本人专业领域研究及成果": null },
    "黑名单": false
};

(function() {
    for (var k1 in obj.可参评物资类别列表)
        for (var k2 in obj.可参评物资类别列表[k1].二级分类)
            if (obj.可参评物资类别列表[k1].二级分类[k2].indexOf('设备') != -1)
                return true;
    return false;
})();
        
    
