using System.Drawing;
using System.Runtime.InteropServices;
using System.Windows.Documents;
using System.Windows.Interop;
using System.Windows.Media.Imaging;
using Go81WebApp.Models.管理器;
using Go81WebApp.Models.数据模型;
using Go81WebApp.Models.数据模型.内容数据模型;
using Go81WebApp.Models.数据模型.商品数据模型;
using Go81WebApp.Models.数据模型.用户数据模型;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using Helpers.印章;
using MongoDB;
using MongoDB.Driver.Builders;

namespace Go81WebApp.ModuleTester
{
    public partial class MainWindow : Window
    {
        private void 添加专家数据(int n)
        {
            for (var i = 0; i < n; ++i)
            {
                专家 zj = new 专家();
                zj.审核数据.审核状态 = 审核状态.审核通过;
                zj.身份信息.姓名 = "姓名" + i;
                zj.所属地域.省份 = "四川省";
                zj.所属地域.城市 = "成都市";
                zj.所属地域.区县 =
                    i % 3 == 0 ? "锦江区" :
                    i % 3 == 1 ? "青羊区" :
                    "金牛区";
                zj.学历信息.最高学历 =
                    i % 2 == 0 ? 学历.博士 :
                    学历.研究生;
                zj.学历信息.最高学位 =
                    i % 3 == 0 ? 学位.博士 :
                    i % 3 == 1 ? 学位.博士后 :
                    学位.硕士;
                zj.工作经历信息.从事专业 =
                    i % 3 == 0 ? "计算机" :
                    i % 3 == 1 ? "材料" :
                    "建筑";
                zj.联系方式.固定电话 = "028-12345678" + i;
                zj.联系方式.手机 = "98765432112" + i;
                zj.身份信息.专家类别 = 专家类别.军内;
                zj.身份信息.专家类型 =
                    i % 3 == 0 ? 专家类型.法律 :
                    i % 3 == 1 ? 专家类型.技术 :
                    专家类型.经济;
                zj.学历信息.专业技术职称 =
                    i % 32 == 0 ? 专业技术职称.主任医师 :
                    i % 32 == 1 ? 专业技术职称.主任技师 :
                    i % 32 == 2 ? 专业技术职称.主任护师 :
                    i % 32 == 3 ? 专业技术职称.主任编辑 :
                    i % 32 == 4 ? 专业技术职称.主任药师 :
                    i % 32 == 5 ? 专业技术职称.主任记者 :
                    i % 32 == 6 ? 专业技术职称.副主任医师 :
                    i % 32 == 7 ? 专业技术职称.副主任技师 :
                    i % 32 == 8 ? 专业技术职称.副主任护师 :
                    i % 32 == 9 ? 专业技术职称.副主任药师 :
                    i % 32 == 10 ? 专业技术职称.副教授 :
                    i % 32 == 11 ? 专业技术职称.副研究员 :
                    i % 32 == 12 ? 专业技术职称.副研究馆员 :
                    i % 32 == 13 ? 专业技术职称.副编审 :
                    i % 32 == 14 ? 专业技术职称.副译审 :
                    i % 32 == 15 ? 专业技术职称.教授 :
                    i % 32 == 16 ? 专业技术职称.研究员 :
                    i % 32 == 17 ? 专业技术职称.研究馆员 :
                    i % 32 == 18 ? 专业技术职称.副研究员 :
                    i % 32 == 19 ? 专业技术职称.编审 :
                    i % 32 == 20 ? 专业技术职称.译审 :
                    i % 32 == 21 ? 专业技术职称.高级会计师 :
                    i % 32 == 22 ? 专业技术职称.高级兽医师 :
                    i % 32 == 23 ? 专业技术职称.高级农艺师 :
                    i % 32 == 24 ? 专业技术职称.高级审计师 :
                    i % 32 == 25 ? 专业技术职称.高级工程师 :
                    i % 32 == 26 ? 专业技术职称.高级工艺美术师 :
                    i % 32 == 27 ? 专业技术职称.高级畜牧师 :
                    i % 32 == 28 ? 专业技术职称.高级经济师 :
                    i % 32 == 29 ? 专业技术职称.高级编辑 :
                    i % 32 == 30 ? 专业技术职称.高级记者 :
                    专业技术职称.其他;
                zj.登录信息.登录名 = DateTime.Now.Ticks + i.ToString();
                zj.登录信息.密码 = "123456";
                zj.可参评物资类别列表 =
                    i%3 == 0
                        ? new List<供应商._产品类别>
                        {
                            new 供应商._产品类别
                            {
                                一级分类 = "办公设备",
                                二级分类 = new List<string>
                                {
                                    "销毁设备",
                                    "制图设备",
                                    "办公耗材",
                                }
                            },
                        }
                        : i%3 == 1
                            ? new List<供应商._产品类别>
                            {
                                new 供应商._产品类别
                                {
                                    一级分类 = "文体器材",
                                    二级分类 = new List<string>
                                    {
                                        "乐器",
                                        "球类",
                                        "训练健身器材",
                                    }
                                },
                            }
                            : new List<供应商._产品类别>
                            {
                                new 供应商._产品类别
                                {
                                    一级分类 = "计算机及通信",
                                    二级分类 = new List<string>
                                    {
                                        "计算机",
                                        "计算机外围设备",
                                        "服务器设备",
                                        "网络设备",
                                        "机房综合设备",
                                        "存储容灾设备",
                                    }
                                },
                            };

                用户管理.添加用户(zj);
            }
        }

        private void 添加商品价格历史数据(long productStockID)
        {
            var p = 商品管理.查找商品(productStockID);
            var rnd = new Random(DateTime.Now.Millisecond);
            for (int i = 0; i < 20; ++i)
            {
                p.销售信息.价格修改日期 = DateTime.Now.AddDays(rnd.Next(i * 5, (i + 1) * 5));
                p.销售信息.价格 = rnd.Next(((i%7) + 3)*100, ((i%7) + 4)*100);
                p.销售信息.销量 = rnd.Next(1000, 10000);
                if (null != p.销售信息
                    && null != p.销售信息.价格属性组合
                    && null != p.销售信息.价格属性组合.组合列表
                    && 0 != p.销售信息.价格属性组合.组合列表.Count)
                {
                    for (int j = 0; j < p.销售信息.价格属性组合.组合列表.Count; ++j)
                    {
                        p.销售信息.价格属性组合.组合列表[j].价格 = rnd.Next(((i % 7) + 3) * 100, ((i % 7) + 4) * 100);
                    }
                    商品管理.更新商品(p);
                }
            }
        }
        //private void 添加测试商品(long catID, long userID)
        //{
        //    var rnd = new Random(DateTime.Now.Millisecond);
        //    for (int i = 0; i < 36; ++i)
        //    {
        //        var p1 = new 商品();
        //        p1.采购信息.参与协议采购 = 0 != rnd.Next() % 2;
        //        p1.商品数据.商品简介 = "商品简介" + rnd.Next().ToString() + "商品简介" + rnd.Next().ToString() + "商品简介" + rnd.Next().ToString();
        //        p1.商品数据.商品详情 = "商品详情" + rnd.Next().ToString() + "商品详情" + rnd.Next().ToString() + "商品详情" + rnd.Next().ToString();
        //        p1.商品数据.售后服务 = "售后服务" + rnd.Next().ToString();
        //        p1.商品数据.商品属性 = new Dictionary<string, Dictionary<string, List<string>>>() {
        //            { "外观", new Dictionary<string, List<string>>() {
        //                {"颜色", new List<string>(){(0!=rnd.Next()%2)?"白色":"黄色",(0!=rnd.Next()%3)?"蓝色":"红色","颜色"+rnd.Next().ToString()}},
        //                {"尺寸", new List<string>(){rnd.Next().ToString()+" x "+rnd.Next().ToString()}},
        //                {"重量", new List<string>(){"7.2kg"}},
        //            }},
        //            { "配置", new Dictionary<string, List<string>>() {
        //                {"CPU", new List<string>(){"i7","i5","i3","ARM "+rnd.Next().ToString()}},
        //                {"内存", new List<string>(){"2G"}},
        //            }},
        //            { "属性分类"+rnd.Next().ToString(), new Dictionary<string, List<string>>() {
        //                {"属性"+rnd.Next().ToString(), new List<string>(){"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString()}},
        //                {"属性"+rnd.Next().ToString(), new List<string>(){"值"+rnd.Next().ToString()}},
        //                {"属性"+rnd.Next().ToString(), new List<string>(){"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString()}},
        //                {"属性"+rnd.Next().ToString(), new List<string>(){"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString()}},
        //                {"属性"+rnd.Next().ToString(), new List<string>(){"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString()}},
        //                {"属性"+rnd.Next().ToString(), new List<string>(){"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString(),"值"+rnd.Next().ToString()}},
        //            }},
        //        };
        //        p1.商品信息.商品名 = "好东西" + rnd.Next().ToString();
        //        p1.销售信息.点击量 = 123;
        //        p1.销售信息.价格 = 723.0M;
        //        p1.销售信息.价格属性组合 = new 商品._价格属性组合()
        //        {
        //            属性列表 = new List<string> { "外观.颜色", "配置.CPU" },
        //            组合列表 = new List<商品._价格属性组合._价格属性搭配>()
        //            {
        //                new 商品._价格属性组合._价格属性搭配(){
        //                    价格 = rnd.Next(),
        //                    库存状态= 商品.库存状态.有货,
        //                    销量 = rnd.Next(),
        //                    属性值表 = new List<string>(){"白色","i7"},
        //                },
        //                new 商品._价格属性组合._价格属性搭配(){
        //                    价格 = rnd.Next(),
        //                    库存状态= 商品.库存状态.有货,
        //                    销量 = rnd.Next(),
        //                    属性值表 = new List<string>(){"白色","i5"},
        //                },
        //                new 商品._价格属性组合._价格属性搭配(){
        //                    价格 = rnd.Next(),
        //                    库存状态= 商品.库存状态.有货,
        //                    销量 = rnd.Next(),
        //                    属性值表 = new List<string>(){"白色","i3"},
        //                },
        //                new 商品._价格属性组合._价格属性搭配(){
        //                    价格 = rnd.Next(),
        //                    库存状态= 商品.库存状态.有货,
        //                    销量 = rnd.Next(),
        //                    属性值表 = new List<string>(){"蓝色","i7"},
        //                },
        //                new 商品._价格属性组合._价格属性搭配(){
        //                    价格 = rnd.Next(),
        //                    库存状态= 商品.库存状态.有货,
        //                    销量 = rnd.Next(),
        //                    属性值表 = new List<string>(){"蓝色","i5"},
        //                },
        //                new 商品._价格属性组合._价格属性搭配(){
        //                    价格 = rnd.Next(),
        //                    库存状态= 商品.库存状态.有货,
        //                    销量 = rnd.Next(),
        //                    属性值表 = new List<string>(){"红色","i5"},
        //                },
        //                new 商品._价格属性组合._价格属性搭配(){
        //                    价格 = rnd.Next(),
        //                    库存状态= 商品.库存状态.有货,
        //                    销量 = rnd.Next(),
        //                    属性值表 = new List<string>(){"红色","i3"},
        //                },
        //            }
        //        };
        //        p1.销售信息.库存状态 = 商品.库存状态.有货;
        //        p1.销售信息.销量 = rnd.Next();
        //        商品管理.添加商品(p1, catID, userID);
        //    }
        //}
        private void 添加分类数据()
        {
            //商品分类 c1;
            /*c1 = 商品分类管理.添加分类("办公设备");
            商品分类管理.添加分类("扫描、复印、打印、传真设备", c1.Id).添加子分类(
                "多功能一体机",
                "静电复印机",
                "热敏复印机",
                "速印机",
                "光化学复印机",
                "激光打印机",
                "喷墨打印机",
                "针式打印机",
                "专业打印机",
                "热敏纸传真机",
                "色带传真机",
                "激光传真机",
                "喷墨传真机",
                "扫描仪");
            商品分类管理.添加分类("销毁设备", c1.Id).添加子分类(
                "光盘粉碎机",
                "硬盘粉碎机",
                "芯片粉碎机",
                "综合销毁设备",
                "碎纸机");
            商品分类管理.添加分类("幻灯及投影设备", c1.Id).添加子分类(
                "幻灯机",
                "投影机",
                "数码投影仪",
                "液晶板投影仪",
                "液晶光阀投影仪",
                "CRT投影仪",
                "实物投影仪");
            商品分类管理.添加分类("照相、摄像机及器材", c1.Id).添加子分类(
                "数码照相机",
                "光学照相机",
                "三脚架",
                "镜头",
                "闪光灯",
                "高拍仪",
                "便携式摄像机",
                "专业摄像机",
                "摄录一体机");
            商品分类管理.添加分类("图书档案设备", c1.Id).添加子分类(
                "拷贝机",
                "缩微影像机",
                "阅读器",
                "冲洗机",
                "其他缩微设备",
                "物理方法消毒设备",
                "化学方法消毒设备",
                "密集柜");
            商品分类管理.添加分类("制图设备", c1.Id).添加子分类(
                "绘图机",
                "制图机",
                "晒图机",
                "其他制图机械");
            商品分类管理.添加分类("办公耗材", c1.Id).添加子分类(
                "打印纸",
                "复印纸",
                "新闻纸",
                "铜版纸",
                "胶版纸",
                "卷筒纸",
                "热敏纸",
                "地图纸",
                "相纸",
                "宣纸",
                "硒鼓",
                "墨盒",
                "色带",
                "笔",
                "文件夹",
                "信封",
                "装订机",
                "订书机",
                "尺子",
                "橡皮",
                "剪刀");
            商品分类管理.添加分类("其他办公设备", c1.Id).添加子分类(
                "电子白板",
                "光电设备",
                "KVM设备",
                "刷卡机",
                "POS机",
                "终端机",
                "触摸式终端设备",
                "点钞机",
                "捆钞机",
                "验钞机",
                "录音笔");
            c1 = 商品分类管理.添加分类("家具");
            商品分类管理.添加分类("木制家具", c1.Id).添加子分类(
                "办公桌",
                "会议桌",
                "餐桌",
                "电脑桌",
                "椅子",
                "凳子",
                "床",
                "沙发",
                "书柜",
                "书架");
            商品分类管理.添加分类("金属家具", c1.Id).添加子分类(
                "金属桌",
                "金属椅",
                "金属凳",
                "金属床",
                "保险柜",
                "档案柜",
                "文件柜");
            商品分类管理.添加分类("其他家具", c1.Id).添加子分类(
                "塑料家具",
                "藤制家具",
                "竹制家具等");
            c1 = 商品分类管理.添加分类("文体器材");
            商品分类管理.添加分类("乐器", c1.Id).添加子分类(
                "钢琴",
                "电子琴",
                "手风琴",
                "竖琴",
                "长笛",
                "短笛",
                "单簧管",
                "双簧管",
                "小号",
                "圆号",
                "长号",
                "大号",
                "小提琴",
                "中提琴",
                "大提琴",
                "低音提琴",
                "定音鼓",
                "大钗",
                "三角铁",
                "小军鼓",
                "竹笛",
                "箫",
                "排箫",
                "唢呐",
                "笙",
                "葫芦丝",
                "古琴",
                "古筝",
                "柳琴",
                "琵琶",
                "三弦",
                "月琴",
                "京胡",
                "板胡",
                "二胡",
                "扬琴",
                "钹",
                "锣",
                "鼓",
                "镲",
                "梆子",
                "板",
                "铃",
                "摇鼓");
            商品分类管理.添加分类("球类", c1.Id).添加子分类(
                "篮球",
                "排球",
                "足球",
                "乒乓球",
                "羽毛球",
                //"羽毛球",
                "乒乓球台",
                "台球桌");
            商品分类管理.添加分类("体育器材及配件", c1.Id).添加子分类(
                "田径器材",
                "举重器材",
                "冰雪器材");
            商品分类管理.添加分类("训练健身器材", c1.Id).添加子分类(
                "跳箱",
                "浪木",
                "小杠铃",
                "哑铃",
                "沙袋",
                "实心球",
                "扩胸器",
                "墙拉力器",
                "功率自行车",
                "握力器",
                "拉力器",
                "健身球",
                "关节练习器",
                "手功能练习器",
                "健身车",
                "远红外健身器",
                "划船器",
                "跑步器",
                "小蹦床");
            商品分类管理.添加分类("运动防护用具", c1.Id).添加子分类(
                "防护手套",
                "防护鞋",
                "防护帽",
                "护具");
            商品分类管理.添加分类("其他文体器材", c1.Id).添加子分类(
                "舞台设备",
                "登山设备");
            c1 = 商品分类管理.添加分类("原材料");
            商品分类管理.添加分类("钢材", c1.Id).添加子分类(
                "工字钢",
                "槽钢",
                "角钢",
                "扁钢",
                "圆钢",
                "方钢",
                "异形钢",
                "螺纹钢",
                "线材",
                "带钢",
                "普通钢中厚板",
                "优质钢中厚板",
                "热轧薄板",
                "冷轧薄板",
                "镀锌板",
                "镀锡板",
                "一般无缝钢管",
                "锅炉钢管",
                "合金钢管",
                "不锈钢管",
                "一般焊管",
                "镀锌管",
                "螺旋管",
                "钢丝",
                "钢丝绳",
                "优质型材",
                "焊接钢管");
            商品分类管理.添加分类("木材", c1.Id).添加子分类(
                "原木",
                "板材",
                "人造板");
            商品分类管理.添加分类("水泥", c1.Id).添加子分类(
                "硅酸盐水泥",
                "普通硅酸盐水泥",
                "彩色硅酸盐水泥",
                "矿渣硅酸盐水泥",
                "火山灰质硅酸盐水泥",
                "粉煤灰硅酸盐水泥",
                "白色硅酸盐水泥");
            商品分类管理.添加分类("煤炭", c1.Id).添加子分类(
                "无烟煤",
                "烟煤",
                "褐煤");
            商品分类管理.添加分类("沥青及制品", c1.Id).添加子分类(
                "油毡",
                "沥青");
            商品分类管理.添加分类("橡胶制品", c1.Id).添加子分类(
                "橡胶管",
                "橡胶圈",
                "橡胶垫");
            商品分类管理.添加分类("塑料制品", c1.Id).添加子分类(
                "塑料薄膜",
                "塑料板",
                "管",
                "型材",
                "塑料丝",
                "绳及编织品",
                "泡沫塑料",
                "塑料人造革",
                "合成革",
                "塑料包装箱及容器",
                "日用塑料制品",
                "塑料零件");
            商品分类管理.添加分类("酸、碱", c1.Id).添加子分类(
                "硫酸",
                "盐酸",
                "硝酸",
                "烧碱",
                "纯碱");
            商品分类管理.添加分类("铜", c1.Id).添加子分类(
                "铜锭");
            商品分类管理.添加分类("铝", c1.Id).添加子分类(
                "铝锭");
            商品分类管理.添加分类("铅", c1.Id).添加子分类(
                "铅锭");
            商品分类管理.添加分类("锌", c1.Id).添加子分类(
                "锌锭");
            商品分类管理.添加分类("铜材", c1.Id).添加子分类(
                "铜板材",
                "铜管材",
                "铜型材",
                "铜丝");
            商品分类管理.添加分类("铝材", c1.Id).添加子分类(
                "铝板",
                "铝棒",
                "铝管",
                "铝带",
                "铝箔",
                "铝型材",
                "铝线");
            商品分类管理.添加分类("其他", c1.Id).添加子分类(
                "玻璃",
                "钢骨架复合材料管",
                "铸铁管");
            c1 = 商品分类管理.添加分类("建筑装修材料");
            商品分类管理.添加分类("卫生洁具", c1.Id).添加子分类(
                "洗脸台（盆）",
                "大便器",
                "小便器",
                "拖布池",
                "浴缸",
                "洗碗池");
            商品分类管理.添加分类("磁砖", c1.Id).添加子分类(
                "釉面砖",
                "通体砖",
                "抛光砖",
                "玻化砖及马赛克");
            商品分类管理.添加分类("地板", c1.Id).添加子分类(
                "实木地板",
                "实木复合地板",
                "强化复合地板",
                "地板革");
            商品分类管理.添加分类("涂料", c1.Id).添加子分类(
                "内墙涂料",
                "外墙涂料",
                "木器漆",
                "金属用漆",
                "地坪漆");
            商品分类管理.添加分类("其他", c1.Id).添加子分类(
                "门",
                "窗",
                "石膏板",
                "开关",
                "插座");
            c1 = 商品分类管理.添加分类("机械设备");
            商品分类管理.添加分类("锅炉、辅机及附件", c1.Id).添加子分类(
                "蒸汽锅炉",
                "高温热水锅炉",
                "超热水锅炉",
                "燃气轮机",
                "锅炉辅机",
                "锅炉配件",
                "零部件");
            商品分类管理.添加分类("原动机", c1.Id).添加子分类(
                "汽轮机",
                "水轮机",
                "蒸汽机",
                "内燃机",
                "辅机");
            商品分类管理.添加分类("电梯", c1.Id).添加子分类(
                "电梯",
                "自动扶梯",
                "自动人行道");
            商品分类管理.添加分类("起重设备", c1.Id).添加子分类(
                "桥式起重机",
                "门式起重机",
                "汽车起重机",
                "轮胎式起重机",
                "履带式起重机",
                "电动葫芦",
                "手动葫芦",
                "升降机",
                "提升机");
            商品分类管理.添加分类("输送设备", c1.Id).添加子分类(
                "机械铲",
                "输送机",
                "输送带",
                "输送管道",
                "自动化立体库物流设备",
                "上下垛输送机",
                "车用上下输送机",
                "伸缩输送机",
                "移动伸缩输送机",
                "移动输送机",
                "全驱动转弯输送机",
                "滚道输送机",
                "半自动拆码垛输送机",
                "垂直上下输送机",
                "自动调偏装置",
                "“十”字自动滚道",
                "全驱动转弯滚道",
                "驱动机架",
                "中间机架",
                "调节机架",
                "调偏托辊",
                "平胶带",
                "无站台输送机",
                "手动液压搬运车");
            商品分类管理.添加分类("装卸设备", c1.Id).添加子分类(
                "内燃叉车",
                "电动叉车",
                "装卸车机",
                "装卸船机");
            商品分类管理.添加分类("泵", c1.Id).添加子分类(
                "离心泵",
                "轴流泵",
                "混流泵");
            商品分类管理.添加分类("阀门", c1.Id).添加子分类(
                "旋塞阀",
                "闸阀",
                "截止阀",
                "球阀",
                "止回阀",
                "节流阀",
                "蝶阀",
                "安全阀",
                "减压阀",
                "疏水器");
            商品分类管理.添加分类("风机", c1.Id).添加子分类(
                "离心式风机",
                "轴流式风机",
                "混流式风机",
                "横流式风机");
            商品分类管理.添加分类("气体压缩机", c1.Id).添加子分类(
                "离心式压缩机",
                "轴流压缩机",
                "往复压缩机");
            商品分类管理.添加分类("制冷空调设备", c1.Id).添加子分类(
                "冷库设备",
                "恒温机（组）",
                "制冰设备",
                "冷藏箱柜",
                "去湿机（组）",
                "制冷压缩机");
            商品分类管理.添加分类("空气净化设备", c1.Id).添加子分类(
                "家用空气净化设备",
                "车载空气净化设备",
                "医用空气净化设备",
                "工业用空气净化设备",
                "工程类空气净化设备");
            商品分类管理.添加分类("水净化设备", c1.Id).添加子分类(
                "小型水净化设备",
                "中型水净化设备",
                "大型水净化设备",
                "商用水净化设备",
                "工业水净化设备",
                "油库油气回收装置",
                "除湿机");
            商品分类管理.添加分类("消防设备", c1.Id).添加子分类(
                "干粉灭火器",
                "二氧化碳灭火器",
                "家用灭火器",
                "车用灭火器",
                "森林灭火器",
                "不锈钢灭火器",
                "水系灭火器",
                "悬挂灭火器",
                "枪式灭火器",
                "灭火器箱",
                "灭火器挂架",
                "室内消火栓",
                "水带",
                "水枪",
                "消防斧",
                "切割工具",
                "消防泵",
                "电动消防泵",
                "发电机消防泵",
                "防爆式潜污泵",
                "电动稳压泵",
                "消防补水泵",
                "中水补水泵",
                "电动潜水消防泵",
                "泡沫液",
                "手提式灭火器",
                "推车式灭火器",
                "灭火毯",
                "消防水带",
                "移动式消防柜全驱动转弯滚道",
                "高起升平衡重式叉车");
            商品分类管理.添加分类("工程机械", c1.Id).添加子分类(
                "断面掘进机",
                "巷道掘进机",
                "小型挖掘机",
                "中型挖掘机",
                "大型挖掘机",
                "推土机",
                "装载机",
                "铲运机",
                "铲抛机",
                "压路机",
                "沥青摊铺机",
                "平地机",
                "扫雪机",
                "吹雪机");
            商品分类管理.添加分类("农业机械", c1.Id).添加子分类(
                "播种机",
                "栽种机",
                "秧苗机",
                "旋耕机",
                "联合耕作机械",
                "果园机械",
                "喷雾机",
                "喷粉机",
                "喷烟机",
                "喷灌设备",
                "滴灌设备",
                "联合收割机",
                "中耕机");
            商品分类管理.添加分类("印刷机械", c1.Id).添加子分类(
                "图像制版机",
                "文字制版机",
                "印刷机",
                "装订机械",
                "切纸机",
                "裁纸机",
                "辅助印刷设备");
            商品分类管理.添加分类("仓储器材", c1.Id).添加子分类(
                "货架",
                "托盘",
                "机架",
                "物流箱",
                "吊夹具",
                "集装箱",
                "手推叉车",
                "平板手推车",
                "机械维修箱组",
                "密集柜");
            c1 = 商品分类管理.添加分类("车辆");
            商品分类管理.添加分类("乘用车辆", c1.Id).添加子分类(
                "小型客车",
                "中型客车",
                "大型客车",
                "越野车");
            商品分类管理.添加分类("载货车辆", c1.Id).添加子分类(
                "微型货车",
                "轻型货车",
                "中型货车",
                "重型货车",
                "自卸汽车");
            商品分类管理.添加分类("牵引车辆", c1.Id).添加子分类(
                "全挂牵引车",
                "半挂牵引车",
                "特种牵引车",
                "其他牵引汽车",
                "蓄电池牵引车",
                "内燃牵引车");
            商品分类管理.添加分类("挂车", c1.Id).添加子分类(
                "牵引杆挂车",
                "半挂车",
                "中置轴挂车");
            商品分类管理.添加分类("特种车辆", c1.Id).添加子分类(
                "消防车",
                "防弹车",
                "除冰车",
                "洒水运水车",
                "高空作业车",
                "沥青运输车",
                "水泥罐车",
                "道路清障车",
                "布障车",
                "医疗车",
                "通信专用车",
                "冷藏车",
                "炊事车",
                "其他专用汽车",
                "高喷消防车",
                "中低压泡沫消防车",
                "消防水车");
            商品分类管理.添加分类("车辆底盘", c1.Id).添加子分类(
                "二类底盘",
                "三类底盘",
                "四类底盘");
            商品分类管理.添加分类("车辆附属设备、零部件及机工具", c1.Id).添加子分类(
                "车身",
                "变速箱",
                "轮胎",
                "车辆配件",
                "零部件",
                "1吨手动液压搬运车",
                "2Q2OST牵引车",
                "1吨平板拖车",
                "2吨平板拖车");
            商品分类管理.添加分类("电动车辆", c1.Id).添加子分类(
                "电动汽车",
                "混合动力车辆",
                "电瓶车",
                "电动自行车",
                "电动轮椅车");
            c1 = 商品分类管理.添加分类("电气设备");
            商品分类管理.添加分类("汽、柴油发电设备", c1.Id).添加子分类(
                "柴油发电机（组）",
                "汽油发电机（组）",
                "移动电站",
                "移动电站网络",
                "直流电动机",
                "无刷直流电动机",
                "异步交流电动机",
                "同步交流电动机");
            商品分类管理.添加分类("光伏风能发电设备", c1.Id).添加子分类(
                "光伏发电设备",
                "风能发电设备",
                "风光柴（汽）互补发电设备");
            商品分类管理.添加分类("电源设备", c1.Id).添加子分类(
                "不间断电源（UPS）",
                "稳压电源",
                "变频器电源",
                "充电机",
                "蓄电池组");
            商品分类管理.添加分类("输变电设备", c1.Id).添加子分类(
                "电力变压器",
                "仪用变压器",
                "试验变压器",
                "特种变压器");
            商品分类管理.添加分类("配电设备", c1.Id).添加子分类(
                "高压配电柜",
                "高压熔断器",
                "高压隔离开关",
                "高压负荷开关",
                "低压开关板",
                "低压照明箱",
                "低压动力箱",
                "低压开关柜",
                "配电盘",
                "开关箱",
                "控制箱",
                "断路器",
                "高压配电瓶",
                "低压配电瓶",
                "配电箱",
                "配电柜");
            商品分类管理.添加分类("电线电缆", c1.Id).添加子分类(
                "裸电线",
                "漆包线",
                "布电线",
                "PVC电线",
                "橡胶电线",
                "电缆",
                "电力电缆",
                "电气装备用电缆",
                "光纤电缆",
                "通信电缆",
                "控制电缆",
                "电缆线");
            商品分类管理.添加分类("生活电器", c1.Id).添加子分类(
                "电视机",
                "视盘机",
                "DVD机",
                "录像机",
                "电唱机",
                "录音机",
                "放音机",
                "收音机",
                "家用空调器",
                "电冰箱",
                "洗衣机",
                "热水器",
                "吸尘器",
                "饮水器",
                "微波炉",
                "电磁炉");
            商品分类管理.添加分类("照明器材", c1.Id).添加子分类(
                "台灯",
                "吸顶灯",
                "壁灯",
                "落地灯",
                "筒灯",
                "格栅灯",
                "庭院灯",
                "草坪灯",
                "景观灯",
                "泛光灯",
                "路灯",
                "灯杆",
                "灯箱",
                "景观照明",
                "手电筒",
                "应急灯",
                "LED灯",
                "灯泡",
                "灯管");
            c1 = 商品分类管理.添加分类("计算机及通信");
            商品分类管理.添加分类("计算机", c1.Id).添加子分类(
                "台式计算机",
                "便携式计算机",
                "掌上计算机",
                "平板计算机",
                "加固计算机",
                "工控机",
                "工作站");
            商品分类管理.添加分类("计算机外围设备", c1.Id).添加子分类(
                "数据采集器",
                "鼠标",
                "键盘",
                "显示器",
                "光驱",
                "硬盘",
                "手写屏",
                "手写板",
                "记录塔",
                "军人保障卡配套应用设备");
            商品分类管理.添加分类("服务器设备", c1.Id).添加子分类(
                "入门级服务器",
                "工作组级服务器",
                "部门级服务器",
                "企业级服务器",
                "加固服务器",
                "刀片服务器",
                "服务器机箱");
            商品分类管理.添加分类("网络设备", c1.Id).添加子分类(
                "路由器",
                "交换机",
                "中继器",
                "集线器",
                "网桥",
                "网关",
                "光端机",
                "调制解调器",
                "网络接入设备（NAS）");
            商品分类管理.添加分类("机房综合设备", c1.Id).添加子分类(
                "机房综合设备");
            商品分类管理.添加分类("存储容灾设备", c1.Id).添加子分类(
                "光盘",
                "光盘库",
                "塔式光盘机",
                "磁带机",
                "磁带库",
                "磁盘机",
                "磁盘阵列",
                "U盘",
                "磁带",
                "存储用光纤机",
                "容灾备份设备");
            商品分类管理.添加分类("网络安全防护设备", c1.Id).添加子分类(
                "主机入侵检测产品",
                "主机审计系统",
                "补丁升级管理系统",
                "非法外联及客户端安全监控系统",
                "网络安全隔离与信息交换设备",
                "防火墙",
                "网络入侵检测设备",
                "VPN",
                "防DOS攻击系统",
                "防病毒网关",
                "漏洞扫描设备",
                "网络综合审计系统",
                "负载均衡",
                "流量分析",
                "UTM",
                "安全认证设备",
                "补丁分发系统",
                "安全管理平台",
                "网闸");
            商品分类管理.添加分类("密码加密设备", c1.Id).添加子分类(
                "网络密码机",
                "服务器密码机",
                "密码卡",
                "密码模块");
            商品分类管理.添加分类("基础通用软件", c1.Id).添加子分类(
                "操作系统",
                "数据库管理系统",
                "网络软件",
                "办公软件",
                "防病毒软件",
                "安全软件",
                "应用软件",
                "多媒体软件",
                "备份软件",
                "软件开发");
            商品分类管理.添加分类("有线通信系统设备", c1.Id).添加子分类(
                "保密电话机",
                "按键式电话机",
                "录音电话机",
                "可视电话机",
                "对讲机",
                "电话交换机",
                "电话中继设备",
                "数据调制解调器",
                "数据交换设备",
                "PDH传输设备",
                "SDH传输设备",
                "波分复用设备",
                "自动交换光设备",
                "PCM设备",
                "网管监控设备",
                "数字同步网设备",
                "程控电话交换机",
                "被覆线");
            商品分类管理.添加分类("无线通信系统设备", c1.Id).添加子分类(
                "无线通信系统设备");
            商品分类管理.添加分类("音视频相关设备", c1.Id).添加子分类(
                "LED屏",
                "箱体屏墙",
                "大型投影机",
                "屏幕",
                "图像处理设备",
                "矩阵",
                "非线性编辑系统",
                "摄像头",
                "监视器",
                "长延时录像机",
                "功放",
                "控制台",
                "视频编辑处理机",
                "功率放大器",
                "音箱",
                "喇叭",
                "话筒",
                "音频编辑处理设备",
                "组合音响",
                "闭路播放设备",
                "同声现场翻译设备",
                "固定式电影放映机",
                "便携式电影放映机",
                "调音台",
                "麦克风",
                "均衡器",
                "效果器",
                "反馈抑制器",
                "压缩限幅器",
                "激励器",
                "分频器",
                "音频处理器",
                "音箱处理器",
                "语音卡",
                "计算机切换矩阵",
                "视音频切换矩阵",
                "信号转换分配设备",
                "视频编码器",
                "音频编码器",
                "视音频处理设备",
                "信号传输控制设备",
                "集中控制系统");
            商品分类管理.添加分类("自动感知控制设备", c1.Id).添加子分类(
                "射频读卡器",
                "条码打印机",
                "条码扫描器",
                "电子标签",
                "手持机",
                "标签识读设备",
                "标签读写设备",
                "射频标签",
                "二维条码标签",
                "温湿度传感器",
                "非接触式智能卡",
                "感知卡",
                "数据采集设备",
                "军人保障标识牌",
                "军人保障卡",
                "末端传感设备",
                "电子围栏",
                "探测器",
                "营区卡",
                "电磁开关");
            商品分类管理.添加分类("安全防护检测设备", c1.Id).添加子分类(
                "计算机干扰器",
                "手机信号屏蔽器",
                "电磁信号屏蔽器",
                "信号屏蔽器",
                "网络安全检测设备",
                "计算机安全检测设备",
                "无线电安全检测设备",
                "有线电话检测设备",
                "移动通信安全检测设备");
            商品分类管理.添加分类("电视电话会议系统设备", c1.Id).添加子分类(
                "视频会议控制台",
                "视频会议室终端",
                "电话会议设备",
                "会议机MCU",
                "摄像头");
            商品分类管理.添加分类("其他设备", c1.Id).添加子分类(
                "卫星导航设备",
                "卫星定位系统",
                "网络测试仪",
                "HBA卡",
                "专用业务软件",
                "控制软件",
                "智能模块等");
            商品分类管理.添加分类("系统集成", c1.Id).添加子分类(
                "软件开发");
            c1 = 商品分类管理.添加分类("仪器仪表");
            商品分类管理.添加分类("自动化仪表", c1.Id).添加子分类(
                "温度仪表",
                "压力仪表",
                "流量仪表",
                "物位及机械化仪表",
                "自动成套控制系统",
                "磁致伸缩液位计",
                "雷达液位计",
                "伺服液位计",
                "阀门电动执行机构",
                "平均温度计",
                "密度计",
                "压力变送器",
                "油气浓度报警装置",
                "消防报警装置（含系统）",
                "防爆门禁装置（含系统）",
                "发油控制器",
                "智能钥匙柜（含系统）",
                "查库巡检仪（含系统）");
            商品分类管理.添加分类("电工仪器仪表", c1.Id).添加子分类(
                "电度表",
                "电阻表",
                "电压表",
                "电流表",
                "万用电表");
            商品分类管理.添加分类("电子和通信测量仪器", c1.Id).添加子分类(
                "脉冲信号发生器",
                "微波信号发生器",
                "声信号发生器",
                "校验信号发生器",
                "自动切换报警信号发生器");
            商品分类管理.添加分类("光学仪器", c1.Id).添加子分类(
                "显微镜",
                "望远镜",
                "光谱仪",
                "红外仪器",
                "激光仪器");
            商品分类管理.添加分类("分析仪器", c1.Id).添加子分类(
                "质谱仪",
                "色谱仪",
                "波谱仪",
                "热学分析仪器",
                "电化学分析仪器");

            c1 = 商品分类管理.添加分类("后勤装备"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "整车改装类装备",
                "方舱制造类装备",
                "机电设备制造类装备",
                "工程机械制造类装备",
                "管线制造类装备",
                "箱组类装备",
                "装具类装备",
                "指挥控制类装备",
                "营具类装备",
                "医疗器械类装备");
            c1 = 商品分类管理.添加分类("被装"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "大（卷）檐帽类",
                "贝雷帽类",
                "栽绒帽类",
                "皮帽类",
                "礼服类",
                "毛料（仿毛）常服类",
                "布料常服类",
                "作训(雨衣)类",
                "工作服装类",
                "针织服装类",
                "毛衣类",
                "皮服类",
                "领带类",
                "皮鞋（靴）类",
                "模压鞋（靴）类",
                "胶布鞋类",
                "硫化鞋靴类",
                "双密度鞋靴类",
                "仪仗队马靴类",
                "袜类",
                "线手套类",
                "皮革手套类",
                "缝制手套类",
                "被褥类",
                "凉席类",
                "毛毯类",
                "毛巾被类",
                "眼镜类",
                "注塑装具类",
                "拉伸装具类",
                "编织（缝制、盖布）装具类",
                "马装具类",
                "军旗类",
                "指挥刀类",
                "金属服饰类",
                "织唛服饰类",
                "硬肩章类",
                "资历章架类",
                "洗涤设备类",
                "机具类",
                "对二氯苯类");
            c1 = 商品分类管理.添加分类("被装材料"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "精纺呢绒类",
                "粗纺呢绒类",
                "化纤仿毛类",
                "混纺（里料）类",
                "迷彩作训类",
                "轧光涂层类",
                "针织绒线类",
                "针织布类",
                "长毛绒类",
                "服饰类",
                "复合纱线类",
                "鞋用材料类",
                "保暖絮片类",
                "衬布类",
                "平剪绒类",
                "拉链类",
                "纽扣类",
                "帽用材料类",
                "其它配件类");
            c1 = 商品分类管理.添加分类("军用食品"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "野战食品",
                "专用食品",
                "罐头食品",
                "奶粉",
                "其他");
            c1 = 商品分类管理.添加分类("给养器材"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "主食加工机械",
                "副食加工机械",
                "包装机械",
                "冷藏设备",
                "分餐设备",
                "炊事炉灶",
                "食品安全检测设备",
                "洗消设备",
                "饮料设备",
                "餐厨垃圾处理设备",
                "普通给养器材",
                "野战给养器材",
                "特种给养器材");
            c1 = 商品分类管理.添加分类("油料设备器材"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "油料储存设备器材",
                "油料输转设备器材",
                "油料收发设备器材",
                "油料安全防护设备器材",
                "油料化验仪器",
                "油料检测设备器材",
                "阀门",
                "管件",
                "线缆",
                "胶管",
                "维修配件",
                "油泵",
                "便携式加油器材过滤器",
                "油水分离器",
                "维修工机具",
                "搬运器材",
                "其它保障器材");
            c1 = 商品分类管理.添加分类("医疗设备"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "眼科诊疗设备",
                "耳鼻喉诊疗设备",
                "中医诊疗设备",
                "医用电子设备",
                "康复理疗设备",
                "病理设备",
                "消毒供应设备",
                "医疗设备维修及质控设备",
                "护理设备",
                "其他医疗设备",
                "手术急救设备",
                "医用内窥镜设备",
                "口腔诊疗设备",
                "检验设备",
                "血液透析过滤设备",
                "超声诊断设备",
                "放射影像设备（含MRI）",
                "放射治疗设备",
                "核医学设备");
            c1 = 商品分类管理.添加分类("医用耗材"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "体外诊断试剂类",
                "电生理类",
                "射频消融类",
                "口腔科耗材类",
                "麻醉类耗材",
                "手术室通用耗材类",
                "消毒类耗材类",
                "透析材料类",
                "医学影像类",
                "医用高分子材料类",
                "卫生材料及敷料类",
                "眼科耗材类",
                "外科材料类",
                "血管介入耗材类",
                "非血管介入类",
                "骨科耗材类",
                "心脏起搏器类");
            c1 = 商品分类管理.添加分类("药品"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "抗微生物用药",
                "抗寄生虫用药",
                "中枢神经系统药物",
                "神经系统药物",
                "循环系统用药",
                "呼吸系统用药",
                "消化系统用药",
                "泌尿系统用药",
                "生殖系统及泌乳功能药物",
                "影响血液及造血系统药物",
                "激素及其有关药物",
                "酶类及其他生化制剂",
                "调节水、电解质及酸碱平衡药物",
                "营养药",
                "抗肿瘤药",
                "影响机体免疫功能药物",
                "减肥药",
                "延缓衰老及相关老年病用药",
                "其他外科用药",
                "消毒防腐收敛用药",
                "皮肤科用药",
                "眼科用药",
                "耳鼻喉科及口腔用药",
                "解毒药",
                "防治矽肺",
                "防治放射病",
                "药用附加剂",
                "诊断用药",
                "放射性药物",
                "杀虫驱蚊灭螺毒鼠药",
                "生物制品",
                "中成药",
                "中药材",
                "军队特需药品");
            c1 = 商品分类管理.添加分类("军事交通器材"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "装卸搬运设备",
                "装卸加固器材",
                "运输保障器材",
                "交通保障器材",
                "指挥监控器材",
                "检修检测器材",
                "教学训练器材");
            c1 = 商品分类管理.添加分类("基建营房工程器材"); c1.分类性质 = 商品分类性质.专用物资; c1.添加子分类(商品分类性质.专用物资,
                "野营住房器材",
                "供电器材",
                "供水器材",
                "通风除湿设备",
                "卫浴器材",
                "供暖及制冷器材",
                "机械零备件",
                "营具",
                "大型工程防护抢修设备",
                "小型工程防护抢修机具器材",
                "战场防护伪装器材",
                "成套营房器材和国外引进器材");
            */
        }
        //private void 添加测试数据()
        //{
        //    var rnd = new Random(DateTime.Now.Millisecond);

        //    添加用户<个人用户>("admin1", "123456");
        //    添加用户<供应商>("admin2", "123456");
        //    添加用户<单位用户>("admin3", "123456");
        //    添加用户<运营团队>("admin4", "123456");
        //    添加用户<供应商>("admin5", "123456");
        //    添加用户<单位用户>("admin6", "123456");
        //    添加用户<运营团队>("admin7", "123456");

        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.发标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.预公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.技术公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.技术公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.技术公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.技术公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.技术公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.废标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.废标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.废标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.流标公告);
        //    添加公告("XXXX单位招标公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.公开招标, 公告.公告性质.流标公告);


        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.单一来源, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.单一来源, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.单一来源, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.竞争性谈判, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.竞争性谈判, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.协议采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.询价采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.询价采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.询价采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.询价采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.询价采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.询价采购, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.邀请招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.邀请招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.邀请招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.邀请招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.邀请招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.邀请招标, 公告.公告性质.中标公告);
        //    添加公告("XXXX单位采购公告" + rnd.Next().ToString(), "XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", 公告.公告类别.邀请招标, 公告.公告性质.中标公告);

        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加新闻("领导" + rnd.Next().ToString() + "莅临" + rnd.Next().ToString() + "单位视察工作", "领导说：" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());

        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加通知("关于" + rnd.Next().ToString() + "的通知" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());

        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //    添加政策法规("关于" + rnd.Next().ToString() + "的法规" + rnd.Next().ToString() + "号", "XXXXXXXXXXXXXXXXXXXXXX" + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString() + rnd.Next().ToString());
        //}
        //void 添加用户<T>(string 登录名, string 密码) where T : 用户基本数据, new()
        //{
        //    var u = new T();
        //    u.登录信息.登录名 = 登录名;
        //    u.登录信息.密码 = 密码;
        //    用户管理.添加用户(u);
        //}
        //void 添加公告(string 标题, string 内容, 公告.公告类别 类别, 公告.公告性质 性质)
        //{
        //    var rnd = new Random(DateTime.Now.Millisecond);
        //    var g1 = new 公告();
        //    g1.公告信息.公告类别 = 类别;
        //    g1.公告信息.公告性质 = 性质;
        //    g1.内容主体.标题 = 标题;
        //    g1.内容主体.内容 = 内容;
        //    g1.审核数据.审核状态 = (0 == rnd.Next() % 2) ? 审核状态.审核通过 : 审核状态.未审核;
        //    公告管理.添加公告(g1);
        //}
        //void 添加新闻(string 标题, string 内容)
        //{
        //    var n = new 新闻();
        //    n.内容主体.标题 = 标题;
        //    n.内容主体.内容 = 内容;
        //    新闻管理.添加新闻(n);
        //}
        //void 添加通知(string 标题, string 内容)
        //{
        //    var n = new 通知();
        //    n.内容主体.标题 = 标题;
        //    n.内容主体.内容 = 内容;
        //    通知管理.添加通知(n);
        //}
        //void 添加政策法规(string 标题, string 内容)
        //{
        //    var n = new 政策法规();
        //    n.内容主体.标题 = 标题;
        //    n.内容主体.内容 = 内容;
        //    政策法规管理.添加政策法规(n);
        //}

        //void 添加基本用户()
        //{
        //    var u = new 运营团队();
        //    u.登录信息.登录名 = "superadmin";
        //    u.登录信息.密码 = "123456";
        //    用户管理.添加用户(u);

        //    var u1 = new 单位用户();
        //    u1.登录信息.登录名 = "cdjqlqb";
        //    u1.登录信息.密码 = "123456";
        //    用户管理.添加用户(u1);

        //    var u2 = new 供应商();
        //    u2.登录信息.登录名 = "gys001";
        //    u2.登录信息.密码 = "123456";
        //    用户管理.添加用户(u2);
        //}

        private void 添加测试机票()
        {
            for (int i = 1; i < 20; i++)
            {
                var jp = new 机票代售点();
                jp.代售点名称 = "代售点" + i;
                jp.地理位置 = new double[] { 104.071929, 30.663528 };
                jp.地址 = "成都市";
                jp.简介 = "机票代收点" + i + "简介,年轻人可能出于想省钱或者年轻力壮等各种原因，会选择床位型的住宿，推荐一家非常靠谱的床位房，我相信对那种总是在喊“台湾住宿怎么那么贵”的朋友会有一些帮助的喔～";
                jp.交通信息 = "机票代售点交通信息代售点，看过《北京爱上西雅图》的朋友，对汤唯抱怨没有厕所的房间不能叫雅房这句台词应该有印象。实际上，在台湾民宿里，这种房型真的就叫雅房。这里就像台湾电影里阿公阿妈的家，喝一杯茶，听一首老歌，古早味十足。出门就能吃到远近闻名的芋圆还有其他更多美食！" + i;
                jp.联系电话 = "2141445214521";
                //jp.所属地域.省份 = "四川省";
                //jp.所属地域.城市 = "成都市";
                //jp.所属地域.区县 =
                //    i % 3 == 0 ? "锦江区" :
                //    i % 3 == 1 ? "青羊区" :
                //    "金牛区";
                jp.所属商圈 = "商圈" + i;
                机票代售点管理.添加机票代售点(jp);
            }
        }

        [DllImport("gdi32.dll")]
        private static extern bool DeleteObject(IntPtr hObject);
        private void SetSeal1(int r)
        {
            var t = new 圆形公章
            {
                //单位签名分布角度 = 222,
                自动计算签名字体大小 = false,
                八一五角星 = true,
            };
            t.单位签名.文字 = "中国人民解放军四川省军区机关";
            //t.单位签名.字体大小 = 18;
            //t.单位签名.字体宽高比 = 2.2F;
            t.业务签名.文字 = "物资集中采购办公室";
            t.业务签名.字体大小 = 15.6F;
            //t.Png文件路径 = "C:\\Users\\D0\\Desktop\\1.png";
            //t.绘制();
            var hb = t.绘制结果.GetHbitmap(Color.Transparent);
            img1.Source = Imaging.CreateBitmapSourceFromHBitmap(hb, IntPtr.Zero, Int32Rect.Empty,
                BitmapSizeOptions.FromEmptyOptions());
            DeleteObject(hb);
        }
        private void SetSeal2(int r)
        {
            var t = new 圆形公章
            {
                //单位签名分布角度 = 222,
            };
            t.单位签名.文字 = "中国人民解放军重庆警备区";
            t.业务签名.文字 = "物资采购办公室";
            //t.Emf文件路径 = "C:\\Users\\D0\\Desktop\\1\\2-"+r+".emf";
            //t.Png文件路径 = "C:\\Users\\D0\\Desktop\\1\\2-" + r + ".png";
            //t.绘制();
            var hb = t.绘制结果.GetHbitmap(Color.Transparent);
            img1.Source = Imaging.CreateBitmapSourceFromHBitmap(hb, IntPtr.Zero, Int32Rect.Empty,
                BitmapSizeOptions.FromEmptyOptions());
            DeleteObject(hb);
        }
    }
}
